app/Controllers/Consultas.php

SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '9'
---
    public function criar($paciente_id)
    {
        $pacienteModel = new PacientesModel();
        $paciente = $pacienteModel->find($paciente_id);