app/Controllers/Pacientes.php

    public function salvar()
    {
        $pacienteModel = new PacienteModel();

        // Upload de arquivo (laudo)
        $laudoUrl = null;
        $file = $this->request->getFile('arquivo');
        if ($file && $file->isValid() && !$file->hasMoved()) {
            $laudoUrl = $file->store('laudos'); // salva em writable/uploads/laudos
        }

        $data = [
            'nome'              => $this->request->getPost('nome'),
            'data_nascimento'   => $this->request->getPost('data_nasc'),
            'cpf'               => $this->request->getPost('cpf'),
            'rg'                => $this->request->getPost('rg'),
            'endereco'          => $this->request->getPost('endereco'),
            'convenio_medico'   => $this->request->getPost('conv_med'),
            'grupo_pacientes'   => $this->request->getPost('grupo_pacientes'),
            'sexo'              => $this->request->getPost('sexo'),
            'medico_solicitante'=> $this->request->getPost('medico_solicitante'),
            'laudo_url'         => $laudoUrl,
            'observacoes'       => $this->request->getPost('observacoes'),
            'data_cadastro'     => date('Y-m-d H:i:s')
        ];

        $pacienteModel->insert($data);
---
INSERT INTO `pacientes` (`nome`, `data_nascimento`, `cpf`, `rg`, `endereco`, `convenio_medico`, `grupo_pacientes`, `sexo`, `medico_solicitante`, `laudo_url`, `observacoes`, `data_cadastro`) VALUES ('maria leticia ramos barbosa', '275760-02-04', '525.252.525-25', '525.252.525', '52525252', '5252525252', '1', 'Masculino', 'valor 1', NULL, '', '2025-08-29 20:11:33')

    public function editar($id)
    {
        $pacienteModel = new PacienteModel();
        $paciente = $pacienteModel->find($id);
---
SELECT *
FROM `pacientes`
WHERE `pacientes`.`id` = '13'