app/Controllers/paghome2.php

SELECT *
FROM `pacientes`
---
    public function index()
    {
        $pacienteModel = new PacientesModel();
        $dados['pacientes'] = $pacienteModel->findAll();