app/Controllers/paghome.php

    public function index()
    {
<<<<<<< HEAD
        $pacienteModel = new PacientesModel();
=======
        $pacienteModel = new PacienteModel();
>>>>>>> 8b77ee2d72a2e04167a97232eb6ef5ed11b6d0b7

        // Puxa todos os registros
        $data['pacientes'] = $pacienteModel->findAll();
---
SELECT *
FROM `pacientes`